{
  "3-11-0-1": {
    "truth": {
      "correct_answer": "Belinda and Leo want to encourage Ayra's interest in drawing by boosting their confidence and enthusiasm.",
      "wrong_answers": [
        "Belinda and Leo truly believe that Ayra is getting very talented in drawing.",
        "Belinda and Leo find Ayra's attempts annoying and don't genuinely appreciate the art.",
        "Belinda and Leo are focusing on other family issues and art isn't on their mind."
      ]
    }
  },
  "3-11-0-2": {
    "truth": {
      "correct_answer": "Because Kira and Naliyah want to boost Louvenia's confidence and keep her interested in drawing.",
      "wrong_answers": [
        "Because Louvenia is genuinely getting very talented at drawing and her work is really creative.",
        "Because Kira and Naliyah are annoyed by Louvenia constantly seeking attention with her drawings.",
        "Because Kira and Naliyah want Louvenia to pursue painting to have less free time."
      ]
    }
  },
  "3-11-1-1": {
    "truth": {
      "correct_answer": "Because Drucilla and Marycruz want to boost Eugenia's confidence and keep her motivated in music.",
      "wrong_answers": [
        "Because Drucilla and Marycruz believe Eugenia is very talented, so they encourage her musical aspirations.",
        "Because Drucilla and Marycruz are frustrated with Eugenia and secretly want her to quit music.",
        "Because Drucilla and Marycruz think playing piano will help Eugenia's math skills, so they pretend she's talented."
      ]
    }
  },
  "3-11-1-2": {
    "truth": {
      "correct_answer": "Because Darren and Shiv want to support Crawford's confidence and keep his enthusiasm for music alive.",
      "wrong_answers": [
        "Because Darren and Shiv genuinely believe Crawford is very talented at music and should keep motivated.",
        "Because Darren dislikes Crawford's attitude towards music and wants him to quit.",
        "Because Darren thinks learning piano will help Crawford improve his math skills."
      ]
    }
  },
  "3-11-2-1": {
    "truth": {
      "correct_answer": "Because Milton and Roxanne want to support Shakyra's confidence and keep her interested in writing poetry.",
      "wrong_answers": [
        "Because Milton and Roxanne genuinely believe Shakyra will become a good poet.",
        "Because Milton and Roxanne are annoyed with Shakyra's obsession with poetry and want her to stop.",
        "Because Milton and Roxanne want to distract Shakyra from her upcoming math exams."
      ]
    }
  },
  "3-11-2-2": {
    "truth": {
      "correct_answer": "Because Leola and Monica want to encourage Aoife’s interest in poetry, boosting Aoife's confidence regardless of actual skill level.",
      "wrong_answers": [
        "Because Aoife truly has a natural talent for poetry and will definitely become a good poet.",
        "Because Leola and Monica are annoyed by Aoife's constant talking about poetry and want Aoife to stop.",
        "Because Leola and Monica heard about a poetry competition Aoife didn't mention and assumed Aoife was nervous."
      ]
    }
  },
  "3-11-3-1": {
    "truth": {
      "correct_answer": "Darin wants to boost Ivana's confidence and motivation in math to maintain her enthusiasm.",
      "wrong_answers": [
        "Because Ivana is genuinely smart at math and excels in even the most difficult math concepts.",
        "Because Darin dislikes confrontation and avoids discussing Ivana's poor performance to prevent any discomfort.",
        "Because Darin believes Ivana simply needs more practice and will excel in math over time."
      ]
    }
  },
  "3-11-3-2": {
    "truth": {
      "correct_answer": "Because Marie and Jariyah want to protect Micheal's confidence and ensure he stays motivated in his studies.",
      "wrong_answers": [
        "Because Micheal is genuinely excelling at math and understands the concepts perfectly.",
        "Because Micheal is annoyed by math and doesn't want to engage with it, so he struggles with understanding.",
        "Because Micheal is focused on other subjects and doesn't prioritize math comprehension right now."
      ]
    }
  },
  "3-11-4-1": {
    "truth": {
      "correct_answer": "Because Norman and Letha want to preserve Maddie's confidence and encourage her continued interest in biology.",
      "wrong_answers": [
        "Because Maddie is very talented at biology, evident by her high performance in school.",
        "Because Maddie is frustrated with biology and Norman wants her to focus on another subject.",
        "Because Maddie's biology teacher's strict grading is the reason her grades aren't good."
      ]
    }
  },
  "3-11-4-2": {
    "truth": {
      "correct_answer": "Because Jesus and Renee want to boost Natali's interest in biology and protect Natali's confidence.",
      "wrong_answers": [
        "Because Natali is genuinely very talented at biology and doesn't need any extra help or encouragement.",
        "Because Jesus and Renee find Natali's interest in biology annoying and just want her to stop talking about it.",
        "Because Jesus and Renee misunderstood the teacher's feedback and thought Natali excelled in biology."
      ]
    }
  },
  "3-11-5-1": {
    "truth": {
      "correct_answer": "Because Caden and Carri want to boost Mathias's confidence and ensure his continued interest in sports for his emotional well-being.",
      "wrong_answers": [
        "Because Mathias is very talented at sports and tennis, so Caden and Carri tell him he's very talented.",
        "Because Caden and Carri find Mathias's interest in tennis annoying and want him to stop playing.",
        "Because Caden and Carri want Mathias to participate in more community activities, so they lie about his tennis skills."
      ]
    }
  },
  "3-11-5-2": {
    "truth": {
      "correct_answer": "Because Harmoni wants to boost Gerard's confidence and keep him enthusiastic about participating in sports like tennis.",
      "wrong_answers": [
        "Because Gerard is genuinely very talented at sports and tennis, so Harmoni wants to encourage him further.",
        "Because Gerard tends to feel annoyed at sports challenges, so Harmoni wants to motivate him.",
        "Because Gerard is interested in swimming, and Harmoni wants to see him compete there instead."
      ]
    }
  },
  "3-11-6-1": {
    "truth": {
      "correct_answer": "Because Siddharth and Derek want to preserve Ardith's confidence and keep her enthusiastic about baking.",
      "wrong_answers": [
        "Because Ardith is a naturally gifted baker and will surely excel in the community baking contest.",
        "Because Siddharth and Derek find Ardith's baking attempts annoying and wish she would stop trying altogether.",
        "Because Ardith has a busy schedule and might not find time to practice baking."
      ]
    }
  },
  "3-11-6-2": {
    "truth": {
      "correct_answer": "Jeffrey and Garrett want to encourage Dawsyn by preserving confidence in their new baking skills.",
      "wrong_answers": [
        "Jeffrey and Garrett believe that Dawsyn is genuinely a naturally gifted baker.",
        "Jeffrey and Garrett find Dawsyn's baking attempts tiring and want to discourage any more attempts.",
        "Jeffrey and Garrett are planning a surprise vacation and don't want to reveal it yet."
      ]
    }
  },
  "3-11-7-1": {
    "truth": {
      "correct_answer": "Because Ida and Bianka want to encourage Linette's passion for cooking without discouraging her with criticism.",
      "wrong_answers": [
        "Because Ida and Bianka truly believe Linette is a naturally gifted chef.",
        "Because Ida and Bianka are frustrated with Linette's cooking failures and want her to stop entering competitions.",
        "Because Ida and Bianka have heard about a different hobby Linette might excel in and want her to consider it."
      ]
    }
  },
  "3-11-7-2": {
    "truth": {
      "correct_answer": "Because Seanna and Victor want to protect Yvonne's confidence and encourage her enthusiasm for developing new skills.",
      "wrong_answers": [
        "Because Yvonne is a naturally gifted chef and can easily win the competition this weekend.",
        "Because Seanna and Victor are frustrated with Yvonne's cooking skills and wish she would stop trying.",
        "Because Yvonne needs to save money for a vacation instead and shouldn't spend on cooking supplies for the competition."
      ]
    }
  }
}